Repository: SamiSolomon/ThesisTrial
Catalog: backend/backend/locale/*/LC_MESSAGES/django.po
Languages: am, or

source: English
am: እንግሊዝኛ
or: Ingiliiziffa

source: Amharic
am: አማርኛ
or: Amhariffa

source: Oromo
am: ኦሮምኛ
or: Oromiffa

source: name
am: ስም
or: maqaa

source: email
am: ኢሜል
or: imeeli

source: latitude
am: ኬር
or: laatiitiyuudii

source: longitude
am: የኬር
or: longitiiyuudii

source: contact
am: እውቂያ
or: qunnamtii

source: location
am: አካባቢ
or: iddoo

source: information
am: መረጃ
or: odeeffannoo

source: image
am: ምስል
or: suuraa

source: description
am: መግለጫ
or: ibsa

source: first name
am: ስም
or: maqaa jalqabaa

source: last name
am: የአባት ስም
or: maqaa abbaa

source: appointment date
am: ቀን
or: guyaa muudama

source: appointment time
am: ሰዓት
or: yeroo muudama

source: family name
am: የቤተሰብ ስም
or: maqaa maatii

source: phone
am: ስልክ
or: bilbila

source: hospital
am: ሆስፒታል
or: hoospitaala

source: message
am: መልእክት
or: ergaa

source: Invalid username or password
am: የተሳሳተ የተጠቃሚ ስም ወይም የይለፍ ቃል
or: Maqaa fayyadamaa ykn jecha iccitiin sirrii miti

source: Must include username and password
am: የተጠቃሚ ስም እና የይለፍ ቃል አስፈላጊ ነው
or: Maqaa fayyadamaa fi jecha iccitiin barbaachisaa dha

source: A new appointment request has been submitted with the following details: Hospital: {appointment.hospital} Service : {appointment.service} Patient Name: {appointment.first_name} {appointment.last_name} Appointment Date: {appointment.appointment_date} Appointment Time: {appointment.appointment_time}
am: አዲስ የቀጠሮ ጥያቄ በተከታታይ ዝርዝር ተላልፏል: ሆስፒታል: {appointment.hospital} አገልግሎት : {appointment.service} የሕብረት ስም: {appointment.first_name} {appointment.last_name} የቀጠሮ ቀን: {appointment.appointment_date} የቀጠሮ ሰዓት: {appointment.appointment_time}
or: Gaaffii muudamaa haaraa dhiyaateera akkasumas Hoospitaala: {appointment.hospital} Tajaajila: {appointment.service} Maqaa Fayyaa: {appointment.first_name} {appointment.last_name} Guyyaa Muudamaa: {appointment.appointment_date} Yeroo Muudamaa: {appointment.appointment_time}

source: New Appointment Request
am: አዲስ የቀጠሮ ጥያቄ
or: Gaaffii Muudamaa Haaraa

source: Latitude and Longitude required
am: ኬር እና የኬር አስፈላጊ ነው
or: Laatiitiyuudii fi Longitiiyuudii barbaachisaa dha

source: to sell the medicine
am: መድኃኒት ለመሸጥ

source: Provides immediate care for life-threatening conditions, injuries, and illnesses. Open 24/7.
am: ለህይወት አስጊ ሁኔታዎች፣ ቁስሎች፣ እና በሽታዎች ድንገተኛ እገዛ ይሰጣል። 24/7 በክፍት ነው።

source: Performs operations and surgical procedures, both elective (planned) and emergency. Includes preoperative and postoperative care.
am: ሁሉም እንቅስቃሴዎችን እና ቀዶ ጥገናዎችን እንቁስቁስ እና አልቅስ ያካትታል። ቅድሚያ እና ቀጣይ እንክብካቤን ይጨምራል።

source: Medical care for infants, children, and adolescents. Includes neonatal intensive care units (NICU) and pediatric intensive care units (PICU).
am: ለሕፃናት፣ ህጻናት፣ እና ወጣቶች ሕክምና እንክብካቤ። የሕፃናት ግንባር እና ህጻናት ግንባር እንክብካቤን ይጨምራል።

source: Care for pregnant women, childbirth, and postpartum care. Includes labor and delivery, neonatal care, and prenatal services.
am: ለእርጉዝ ሴቶች እንክብካቤ፣ ወሊድ፣ እና የህክምና እንክብካቤ። የእርጉዝነት እና ህክምና እንክብካቤን ይጨምራል።

source: Yekatit 12 Hospital, located in the 6 Kilo area, offers a wide range of medical services to meet the needs of the community. Our state-of-the-art facilities and experienced medical staff ensure that patients receive the highest quality care
am: በ6 ኪሎ አካባቢ የተገኘ የየካቲት 12 ሆስፒታል ለማህበረሰቡ ፍላጎት ስፋት ያለውን የሕክምና አገልግሎት ያቀርባል። የእኛ የመጀመሪያ የጥበቃ መሳሪያዎችና የተሞክሮ የሕክምና ሰራተኞች ታክቶ ተሞክሮ እንክብካቤ ያገኙም።

source: Specialized hospitals are healthcare facilities that focus on providing advanced and targeted medical care in specific areas of medicine. These hospitals are equipped with specialized equipment, highly trained medical staff, and dedicated departments for various health conditions
am: በልዩ ልዩ የሕክምና ክፍሎች ላይ ትኩረት ስትሰጥ የሕክምና እንክብካቤ ተቋማት የሆኑ ልዩ ሆስፒታሎች ለበለይ በተዘረዘሩ የሕክምና አገልግሎት የተሞክሮ የመሳሪያዎችና የሞክሮ ሰራተኞች ያበቃል።

source: Saint Paul Hospital, located at Pastor Square, is dedicated to providing top-notch healthcare services to the community. We offer a wide array of services to ensure comprehensive medical care for our patients,
am: በቤስተር አካባቢ የሚገኘው የአማርኛ ሆስፒታል ለማህበረሰቡ የጠንካራ የሕክምና አገልግሎት ማቅረብ ላይ ተጣየ። ለደኞቻችን ምቹ የሆነ የሕክምና እንክብካቤን ለማስቻል በስፋት ያለ አገልግሎት እንቀርባለን።
